diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧислоДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыВКМ_ОтпускаСотрудников

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковПриИзменении(Элемент)
	
	ТекДанные = Элементы.ВКМ_ОтпускаСотрудников.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.ВКМ_ДатаНачала) И ЗначениеЗаполнено(ТекДанные.ВКМ_ДатаОкончания) Тогда 
		
		ТекДанные.ВКМ_ЧислоДнейОтпуска = (КонецДня(ТекДанные.ВКМ_ДатаОкончания) + 1 - НачалоДня(ТекДанные.ВКМ_ДатаНачала)) / (24 * 3600);
		ОбновитьОтображениеДанных();		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_АнализГрафика(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВКМ_Год) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните год.");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Объект", ПоместитьДанныеВоВременноеХранилище());
	ПараметрыФормы.Вставить("Год", ПоместитьГодВоВременноеХранилище());
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы, ЭтотОбъект); 
	
КонецПроцедуры 

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()
	Данные = ПоместитьВоВременноеХранилище(Объект.ВКМ_ОтпускаСотрудников.Выгрузить(), УникальныйИдентификатор);
	Возврат Данные;
КонецФункции

&НаСервере
Функция ПоместитьГодВоВременноеХранилище()
	Год = ПоместитьВоВременноеХранилище(Объект.ВКМ_Год, УникальныйИдентификатор); 
	Возврат Год;
КонецФункции

#КонецОбласти
